docs/mediciones/perf/k6-console-auth-cold-run5.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: /scripts/comisiones-load.js
        output: json (/output/k6-auth-cold-run5.json)

     scenarios: (100.00%) 1 scenario, 50 max VUs, 1m0s max duration (incl. graceful stop):
              * default: 50 looping VUs for 30s (gracefulStop: 30s)


Run       [ 100% ] setup()
default   [   0% ]

running (0m02.0s), 50/50 VUs, 0 complete and 0 interrupted iterations
default   [   2% ] 50 VUs  00.7s/30s

running (0m03.0s), 50/50 VUs, 50 complete and 0 interrupted iterations
default   [   6% ] 50 VUs  01.7s/30s

running (0m04.0s), 50/50 VUs, 100 complete and 0 interrupted iterations
default   [   9% ] 50 VUs  02.7s/30s

running (0m05.0s), 50/50 VUs, 150 complete and 0 interrupted iterations
default   [  12% ] 50 VUs  03.7s/30s

running (0m06.0s), 50/50 VUs, 200 complete and 0 interrupted iterations
default   [  16% ] 50 VUs  04.7s/30s

running (0m07.0s), 50/50 VUs, 250 complete and 0 interrupted iterations
default   [  19% ] 50 VUs  05.7s/30s

running (0m08.0s), 50/50 VUs, 300 complete and 0 interrupted iterations
default   [  22% ] 50 VUs  06.7s/30s

running (0m09.0s), 50/50 VUs, 345 complete and 0 interrupted iterations
default   [  26% ] 50 VUs  07.7s/30s

running (0m10.0s), 50/50 VUs, 371 complete and 0 interrupted iterations
default   [  29% ] 50 VUs  08.7s/30s

running (0m11.0s), 50/50 VUs, 418 complete and 0 interrupted iterations
default   [  32% ] 50 VUs  09.7s/30s

running (0m12.0s), 50/50 VUs, 464 complete and 0 interrupted iterations
default   [  36% ] 50 VUs  10.7s/30s

running (0m13.0s), 50/50 VUs, 511 complete and 0 interrupted iterations
default   [  39% ] 50 VUs  11.7s/30s

running (0m14.0s), 50/50 VUs, 558 complete and 0 interrupted iterations
default   [  42% ] 50 VUs  12.7s/30s

running (0m15.0s), 50/50 VUs, 606 complete and 0 interrupted iterations
default   [  46% ] 50 VUs  13.7s/30s

running (0m16.0s), 50/50 VUs, 653 complete and 0 interrupted iterations
default   [  49% ] 50 VUs  14.7s/30s

running (0m17.0s), 50/50 VUs, 703 complete and 0 interrupted iterations
default   [  52% ] 50 VUs  15.7s/30s

running (0m18.0s), 50/50 VUs, 750 complete and 0 interrupted iterations
default   [  56% ] 50 VUs  16.7s/30s

running (0m19.0s), 50/50 VUs, 800 complete and 0 interrupted iterations
default   [  59% ] 50 VUs  17.7s/30s

running (0m20.0s), 50/50 VUs, 850 complete and 0 interrupted iterations
default   [  62% ] 50 VUs  18.7s/30s

running (0m21.0s), 50/50 VUs, 900 complete and 0 interrupted iterations
default   [  66% ] 50 VUs  19.7s/30s

running (0m22.0s), 50/50 VUs, 950 complete and 0 interrupted iterations
default   [  69% ] 50 VUs  20.7s/30s

running (0m23.0s), 50/50 VUs, 1000 complete and 0 interrupted iterations
default   [  72% ] 50 VUs  21.7s/30s

running (0m24.0s), 50/50 VUs, 1050 complete and 0 interrupted iterations
default   [  76% ] 50 VUs  22.7s/30s

running (0m25.0s), 50/50 VUs, 1100 complete and 0 interrupted iterations
default   [  79% ] 50 VUs  23.7s/30s

running (0m26.0s), 50/50 VUs, 1150 complete and 0 interrupted iterations
default   [  82% ] 50 VUs  24.7s/30s

running (0m27.0s), 50/50 VUs, 1200 complete and 0 interrupted iterations
default   [  86% ] 50 VUs  25.7s/30s

running (0m28.0s), 50/50 VUs, 1250 complete and 0 interrupted iterations
default   [  89% ] 50 VUs  26.7s/30s

running (0m29.0s), 50/50 VUs, 1300 complete and 0 interrupted iterations
default   [  92% ] 50 VUs  27.7s/30s

running (0m30.0s), 50/50 VUs, 1350 complete and 0 interrupted iterations
default   [  96% ] 50 VUs  28.7s/30s

running (0m31.0s), 50/50 VUs, 1400 complete and 0 interrupted iterations
default   [  99% ] 50 VUs  29.7s/30s

running (0m32.0s), 22/50 VUs, 1450 complete and 0 interrupted iterations
default ↓ [ 100% ] 50 VUs  30s

     ✓ status es 200
     ✓ no es error 5xx

     checks.........................: 100.00% 2944 out of 2944
     data_received..................: 1.3 MB  40 kB/s
     data_sent......................: 1.5 MB  47 kB/s
     http_req_blocked...............: avg=30.75µs  min=1.99µs  med=8.36µs   max=1.53ms  p(90)=23.99µs p(95)=55.74µs 
     http_req_connecting............: avg=13.64µs  min=0s      med=0s       max=1.12ms  p(90)=0s      p(95)=0s      
   ✓ http_req_duration..............: avg=34.45ms  min=6.16ms  med=15.94ms  max=1.12s   p(90)=82.39ms p(95)=106.89ms
       { expected_response:true }...: avg=34.45ms  min=6.16ms  med=15.94ms  max=1.12s   p(90)=82.39ms p(95)=106.89ms
   ✓ http_req_failed................: 0.00%   0 out of 1475
     http_req_receiving.............: avg=965.54µs min=45.07µs med=538.54µs max=23.72ms p(90)=1.87ms  p(95)=3.02ms  
     http_req_sending...............: avg=55.83µs  min=4.13µs  med=28.57µs  max=3.82ms  p(90)=90.56µs p(95)=137.04µs
     http_req_tls_handshaking.......: avg=0s       min=0s      med=0s       max=0s      p(90)=0s      p(95)=0s      
     http_req_waiting...............: avg=33.42ms  min=5.97ms  med=15.31ms  max=1.11s   p(90)=80.6ms  p(95)=103.02ms
     http_reqs......................: 1475    45.669673/s
     iteration_duration.............: avg=1.03s    min=1s      med=1.01s    max=1.24s   p(90)=1.08s   p(95)=1.1s    
     iterations.....................: 1472    45.576785/s
     vus............................: 22      min=0            max=50
     vus_max........................: 50      min=50           max=50


running (0m32.3s), 00/50 VUs, 1472 complete and 0 interrupted iterations
default ✓ [ 100% ] 50 VUs  30s